In [1]:
import pandas as pd

In [10]:
df = pd.read_csv("text.csv")

In [13]:
df

  No\tName\tSubject
0     1\tharsh \tDS
1      2\tmeet\tADA
2       3\tjay \tCS
3     4\tarun \tADA
4        5\thet\tCS
5      6\tkeval\tDS
6     7\tsavan\tADA
7      8\tmilan\tCS
8     9\trahuk\tADA
9      10\tjeop\tDS

df.head()
for the use pf the read the first five data only

In [18]:
df.head()

  No\tName\tSubject
0     1\tharsh \tDS
1      2\tmeet\tADA
2       3\tjay \tCS
3     4\tarun \tADA
4        5\thet\tCS

In [19]:
df.head(3)

  No\tName\tSubject
0     1\tharsh \tDS
1      2\tmeet\tADA
2       3\tjay \tCS

    df.tail() it show the last five recods

In [20]:
df.tail()

  No\tName\tSubject
5      6\tkeval\tDS
6     7\tsavan\tADA
7      8\tmilan\tCS
8     9\trahuk\tADA
9      10\tjeop\tDS

In [21]:
df.tail(3)

  No\tName\tSubject
7      8\tmilan\tCS
8     9\trahuk\tADA
9      10\tjeop\tDS

In [22]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df.columns

Index(['No\tName\tSubject'], dtype='object')

In [30]:
list(df.columns)

['No\tName\tSubject']

In [7]:
df[['Name','Subject']]

NameError: name 'df' is not defined

In [8]:
df.dtypes

NameError: name 'df' is not defined

In [15]:
import pandas as pd

df = pd.read_csv("text.csv")

In [20]:
df

  No\tName\tSubject
0     1\tharsh \tDS
1      2\tmeet\tADA
2       3\tjay \tCS
3     4\tarun \tADA
4        5\thet\tCS
5      6\tkeval\tDS
6     7\tsavan\tADA
7      8\tmilan\tCS
8     9\trahuk\tADA
9      10\tjeop\tDS

In [21]:
df.dtypes

No\tName\tSubject    object
dtype: object

In [22]:
pd.read_excel("Updates.xlsx")

FileNotFoundError: [Errno 2] No such file or directory: 'Updates.xlsx'

In [23]:
pd.read_excel("Updates.xlsx")

    Days                                    Tasks Completed      date
0      1      js 2 lec completed and solve 2 problem of DSA  13/09.23
1      2             js 1 lec completed, solve 1 problem lc        14
2      3  js lec 1 lec completed, DS hw complete,solve 1 lc        15
3      4    js lec 1 completed,cn work completed,pyfun lec         16
4      5           js 2 lec completed ,ds work,1 lec com py        17
..   ...                                                ...       ...
95    96                                                NaN       NaN
96    97                                                NaN       NaN
97    98                                                NaN       NaN
98    99                                                NaN       NaN
99   100                                                NaN       NaN

[100 rows x 3 columns]

In [25]:
df1 = pd.read_excel('Updates.xlsx')

In [26]:
type(df1)

pandas.core.frame.DataFrame

In [28]:
df1.dtypes

Days                int64
Tasks Completed    object
date               object
dtype: object

In [35]:
df1.columns

Index(['Days', 'Tasks Completed', 'date'], dtype='object')

In [31]:
df2 = pd.read_csv('titanic.csv')

In [36]:
df2.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [38]:
type(df2)

pandas.core.frame.DataFrame

df2[['Survived']]

Pandas can read structured data easily

In [49]:
df2.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

for store the data in some file system

In [50]:
df1.to_csv('dailyupdates.csv')